{"config": [{"config": {"output_shape": null, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-6-cd0119300b5f>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "bias": true, "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_1", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "bias": true, "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_2", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "bias": true, "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_3", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "bias": true, "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_4", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "bias": true, "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_5", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "elu", "W_regularizer": null, "input_dim": 1152, "trainable": true, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "elu", "W_regularizer": null, "input_dim": 100, "trainable": true, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "elu", "W_regularizer": null, "input_dim": 50, "trainable": true, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 10, "trainable": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}