{"config": [{"config": {"function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "batch_input_shape": [null, 75, 200, 3], "output_shape_type": "raw", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-6-b6e45e5ec0c4>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "name": "convolution2d_1", "dim_ordering": "tf", "b_regularizer": null, "activation": "elu", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "name": "convolution2d_2", "dim_ordering": "tf", "b_regularizer": null, "activation": "elu", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "name": "convolution2d_3", "dim_ordering": "tf", "b_regularizer": null, "activation": "elu", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "name": "convolution2d_4", "dim_ordering": "tf", "b_regularizer": null, "activation": "elu", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "name": "convolution2d_5", "dim_ordering": "tf", "b_regularizer": null, "activation": "elu", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "activation": "elu", "W_regularizer": null, "trainable": true, "output_dim": 100, "input_dim": 2304, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "b_regularizer": null, "activation": "elu", "W_regularizer": null, "trainable": true, "output_dim": 50, "input_dim": 100, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_3", "b_regularizer": null, "activation": "elu", "W_regularizer": null, "trainable": true, "output_dim": 10, "input_dim": 50, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_4", "b_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": 10, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}