{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-6-b6e45e5ec0c4>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_1", "trainable": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "trainable": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "trainable": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_4", "trainable": true, "nb_col": 3, "W_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_5", "trainable": true, "nb_col": 3, "W_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_1", "trainable": true, "input_dim": 1152, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 100, "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_2", "trainable": true, "input_dim": 100, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 50, "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_3", "trainable": true, "input_dim": 50, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 10, "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_4", "trainable": true, "input_dim": 10, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 1, "activation": "linear"}}], "class_name": "Sequential"}